{
  "name": "Matthew Keefe",
  "title": "Software Engineering Manager",
  "summary": {
    "professional_summary": "Empowering people to deliver their best work by maximizing the power of technology with disciplined processes, building inclusive teams that create resilient systems and inspire innovation.\n\nLead Software Engineering professional with comprehensive experience directing global teams to deliver scalable, cloud-native platforms and solutions. Skilled in people leadership through full employee lifecycle, with proven record of building high-performing, inclusive teams. Expertise in Agile delivery on cloud platforms, DevOps strategy, and platform modernization. Recognized for aligning technical initiatives with business objectives, fostering accountability, and driving measurable outcomes in complex environments.",
    "key_skills": [
      "people_leadership",
      "global_team_management",
      "agile",
      "devops_strategy",
      "cicd",
      "salesforce_platform",
      "servicenow",
      "governance",
      "change_mgmt",
      "portfolio_mgmt",
      "program_mgmt",
      "executive_comms",
      "stakeholder_mgmt",
      "process_automation",
      "ai_enablement"
    ],
    "technical_proficiencies": [
      "apex",
      "lwc",
      "visualforce",
      "soql",
      "flow",
      "sales_cloud",
      "service_cloud",
      "experience_cloud",
      "crm_analytics",
      "typescript",
      "react",
      "bash",
      "power_bi",
      "jira",
      "confluence",
      "leanix_cmdb",
      "servicenow",
      "github_actions",
      "bamboo",
      "harness",
      "excel_advanced",
      "sharepoint_teams"
    ]
  },
  "employment": [
    {
      "title": "Senior Engineering Manager",
      "company": "CDK Global | Hoffman Estates, IL",
      "start_date": "2022",
      "end_date": "2025",
      "summary": "Led global teams of software engineers and analysts across multiple functional groups responsible for delivering scalable, high-quality, enterprise applications. Managed full employee lifecycle, including hiring, onboarding, performance management, and professional development. Partnered with senior leadership (directors and VPs), HR, and PMO teams to align technical strategy and roadmap with business objectives.",
      "experience": [
        {
          "text": "Directed successful enterprise-wide implementation of Strategic Program Management (SPM) in ServiceNow in partnership with PMO, enabling improved visibility and work execution across demand-to-delivery workflows, resulting in 100% adoption.",
          "tags": ["servicenow_spm", "portfolio_mgmt", "governance"]
        },
        {
          "text": "Integrated Test Management and advanced reporting capabilities in ServiceNow for approximately 200 users, facilitating user training sessions for 5+ teams across departments.",
          "tags": ["servicenow_test_mgmt", "servicenow", "training_enablement"]
        },
        {
          "text": "Standardized work management practices; realigned Scrum Master support to ensure consistent methodology across enterprise app teams.",
          "tags": ["agile", "governance", "process_automation"]
        },
        {
          "text": "Transitioned Enterprise Applications to a hybrid Waterfall/Agile model in ServiceNow, improving visibility across dev, ops, and break-fix.",
          "tags": ["servicenow", "agile", "governance"]
        },
        {
          "text": "Orchestrated cyber incident response affecting 150+ applications; led outage bridge, CMDB remediation, and restoration efforts.",
          "tags": ["incident_response", "leanix_cmdb", "program_mgmt"]
        },
        {
          "text": "Introduced and led AI training programs that encouraged adoption and equipped peers with time-saving practices, strengthening overall team efficiency.",
          "tags": ["ai_enablement", "training_enablement"]
        },
        {
          "text": "Oversaw evolution of Salesforce DevOps pipelines from Bamboo to GitHub Actions and subsequently to Harness.io, retiring Change Sets and streamlining deployment processes, reducing configuration change deployment by 50%+ and ensuring full traceability and compliance across releases.",
          "tags": ["sf_devops", "bamboo", "github_actions", "harness", "cicd", "bash", "governance"]
        },
        {
          "text": "Developed and refined Power BI dashboards and KPIs focused on SLA accountability for managed service provider, leveraging Power Query M, DAX, and REST API connections, leading to 99%+ SLA adherence.",
          "tags": ["power_bi", "power_query_m", "dax", "rest_api"]
        },
        {
          "text": "Drove a culture of continuous learning and accountability, reaching 100% completion of team training and development goals.",
          "tags": ["people_leadership", "training_enablement"]
        }
      ]
    },
    {
      "title": "Engineering Manager",
      "company": "CDK Global | Hoffman Estates, IL",
      "start_date": "2019",
      "end_date": "2022",
      "summary": "Managed cross-functional, global teams delivering internal product applications and platform services. Partnered closely with product, architecture, and business stakeholders to align priorities, drive delivery, and scale DevOps capabilities.",
      "experience": [
        {
          "text": "Designed architecture and managed delivery across teams for a full-stack NodeJS and React Sales Discovery application integrated with standard and custom Salesforce REST APIs.",
          "tags": ["node", "react", "sf_rest_api"]
        },
        {
          "text": "Oversaw all aspects of team operations, demonstrating experience in hiring, onboarding, goal-setting, reviews, mentoring, performance improvement, engagement, motivation, career planning, and retention.",
          "tags": ["people_leadership"]
        },
        {
          "text": "Developed Agile dashboards in Jira with custom reports, tracking metrics and sprint delivery, linking work items to releases, and providing transparency for leadership.",
          "tags": ["jira", "agile", "governance", "reporting"]
        },
        {
          "text": "Championed Agile methodologies, facilitating adoption of Scrum practices and ongoing process improvement.",
          "tags": ["agile", "process_automation"]
        },
        {
          "text": "Mentored interns and junior engineers to grow platform familiarity and skills.",
          "tags": ["people_leadership", "training_enablement"]
        },
        {
          "text": "Established platform governance and best practices, shaping UI/UX decisions and tooling selection.",
          "tags": ["governance", "ui_ux"]
        },
        {
          "text": "Implemented Slack workflow integrations to streamline issue triage.",
          "tags": ["slack_automation", "process_automation"]
        },
        {
          "text": "Detailed flow diagrams and documentation, supporting cross-team collaboration and process clarity.",
          "tags": ["documentation"]
        }
      ]
    },
    {
      "title": "Development Supervisor",
      "company": "CDK Global | Hoffman Estates, IL",
      "start_date": "2017",
      "end_date": "2019",
      "summary": "Supervised local and offshore engineering teams. Provided technical leadership and project oversight for Salesforce platform implementations. Contributed to architecture design, cross-team collaboration, and team growth during a critical phase of enterprise system modernization. Oversaw successful launch of new Salesforce instance and migration of Employee Portal (Experience Cloud).",
      "experience": [
        {
          "text": "Led hiring and onboarding efforts for engineering roles, contributing to team expansion and capability growth.",
          "tags": ["people_leadership"]
        },
        {
          "text": "Guided application architecture, Salesforce Service Cloud integration standards, UI/UX best practices, platform design, and technical standards.",
          "tags": ["service_cloud", "ui_ux", "governance"]
        }
      ]
    },
    {
      "title": "Software Engineer Team Lead",
      "company": "CDK Global | Hoffman Estates, IL",
      "start_date": "2014",
      "end_date": "2017",
      "summary": "Coordinated team of 10+ software engineers supporting multiple internal business units. Provided technical direction, established development standards, and drove collaboration across delivery teams to improve code quality, platform consistency, and user experience.",
      "experience": [
        {
          "text": "Built organizational Salesforce development skills through knowledge-sharing sessions, coaching, and mentoring, resulting in stronger technical depth and faster delivery across teams on the Salesforce platform.",
          "tags": ["salesforce_platform", "training_enablement"]
        },
        {
          "text": "Defined coding/programming standards, documentation practices, and code review processes, promoting maintainability and consistency.",
          "tags": ["governance", "documentation"]
        }
      ]
    },
    {
      "title": "Additional Related Experience",
      "company": "",
      "summary": "CDK Global, Hoffman Estates, IL: Applications Developer — Awana, Streamwood, IL: Developer, Manager, Systems Analyst",
      "experience": [
        {
          "text": "Earlier roles focused on application development, platform support, and systems analysis across Salesforce and .NET ecosystems.",
          "tags": ["salesforce_platform", "csharp", "rest_api"]
        }
      ]
    }
  ],
  "education": [
    {
      "title": "Bachelor of Science (BS) in Computer Science",
      "school": "Northern Illinois University, DeKalb, IL",
      "gpa": "3.33 / 4.0"
    }
  ],
  "certifications": [
    {
      "name": "Harness Certified Continuous Integration Developer",
      "issuer": "Harness University",
      "description": "Demonstrated expertise in pipeline configuration, build optimization, and CI strategy using Harness.io.",
      "date": "2024"
    },
    {
      "name": "Salesforce Trailhead Ranger",
      "issuer": "Salesforce Trailhead",
      "description": "Achieved Ranger status with 100+ badges and 50K points, covering topics such as Salesforce development, DevOps, and architecture.",
      "date": ""
    }
  ]
}
